%显示多项式曲线
a = [1 2 1];
x1 = -50:0.5:50;    	%切片格式　（含）开始位置：步长：（含）结束位置
y1 = polyval(a,x1);     %多项式的计算，a代表每一项的系数，x代表要计算的x点，返回对应的y点
plot(x1,y1);            

%显示三角函数曲线
x2 = -pi:2*pi/100:pi;
y2 = sin(x2);
plot(x2,y2);

%显示直线
x3 = 1:0.5:100;
y3 = 3*x+5;
plot(x3,y3)

%显示多条曲线
x4 = x2;
y4 = cos(x4);
plot(x4,y4,x2,y2,'r--');

%打开多个独立窗口
figure(1);
plot(x2,y2);        
figure(2);
plot(x4,y4);    
figure(1);      %这个窗口的序号不一定要按顺序，仅代表不同窗口的序号
plot(x1,y1);            

%分割一个窗口，显示多个图像
x5 = linspace(0,4*pi,100);  %生成列表，指定开始位置，结束位置，所有数目，自动计算间隔
y5 = tan(x5);
subplot(4,1,1);             %指定分割一个窗口显示多个图像，第一个参数代表行，第二个参数代表列，第三个参数代表其中的第几个
plot(x1,y1);                %停留在上一个指定的窗口操作
subplot(4,1,2);
plot(x2,y2);
subplot(4,1,3);
plot(x3,y3);
subplot(4,1,4);
plot(x4,y4);

%显示标题栏等标注
figure(2);      %指定窗口号
plot(x4,y4,x2,y2,'r--');
title('这里是标题','Fontsize',30);   	%可以字体设定大小
xlabel('这里是横坐标','Fontsize',20);
ylabel('这里是纵坐标','Fontsize',10);

%绘制复数向量图
x6 = x5.*exp(i*x5);
plot(x6)

%绘制极坐标图
y6 = sin(2*x5).*cos(2*x5);
polar(x5,y6);       %注意不是plot而是polar，调用不同的显示函数。

%第四章习题一：绘制４条不同的曲线
close all
x7 = -10:0.2:10;
y7 = x7+3;
subplot(4,1,1);
plot(x7,y7)
%
y8 = x7;
x8 = (y8.^2+1)./3;
subplot(4,1,2);
plot(x8,y8)
%
y9 = 4*x7.^2+1;
subplot(4,1,3);
plot(x7,y9)
%重点是这个双曲线的计算，要遵循数学规律。
y10 = x7;
x10_1 = (4+y10.^2).^0.5;
x10_2 = -(4+y10.^2).^0.5;
subplot(4,1,4);
plot(x10_1,y10,x10_2,y10)

%第四章习题二：显示分段函数
close all       %关闭所有窗口
x11 = -9:0.1:0;
y11 = 3*(sin(x11-pi/3)).^2;
x12 = 0:0.1:7;
y12 = 4*x12.^2-1;
x13 = 7:0.1:18;
y13 = x13.*exp(7-x13);
plot(x11,y11,x12,y12,x13,y13);
legend();       %显示图注

%第四章习题三：显示空间曲线／空间网线／空间曲面
close all       %关闭所有窗口
t14 = linspace(0,4*pi,100);
x14 = 4*sin(t14);
y14 = 4*cos(t14);
z14 = 4*t14;
plot3(x14,y14,z14,'-b');    %绘制三维螺旋线






